zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47B42Z96/KW47B42Z96_cm33_core1_COMMON.h
/* SFA - Peripheral instance base addresses */
/** Peripheral SFA0 base address */
#define SFA0_BASE                                (0xA919D000u)
/** Peripheral SFA0 base pointer */
#define SFA0                                     ((SFA_Type *)SFA0_BASE)
/** Peripheral RF_SFA base address */
#define RF_SFA_BASE                              (0xA9106300u)
/** Peripheral RF_SFA base pointer */
#define RF_SFA                                   ((SFA_Type *)RF_SFA_BASE)
/** Array initializer of SFA peripheral base addresses */
#define SFA_BASE_ADDRS                           { SFA0_BASE, RF_SFA_BASE }
/** Array initializer of SFA peripheral base pointers */
#define SFA_BASE_PTRS                            { SFA0, RF_SFA }

/* SMSCM - Peripheral instance base addresses */
/** Peripheral SMSCM base address */
#define SMSCM_BASE                               (0xA9195000u)
/** Peripheral SMSCM base pointer */
#define SMSCM                                    ((SMSCM_Type *)SMSCM_BASE)
/** Array initializer of SMSCM peripheral base addresses */
#define SMSCM_BASE_ADDRS                         { SMSCM_BASE }
/** Array initializer of SMSCM peripheral base pointers */
#define SMSCM_BASE_PTRS                          { SMSCM }

/* SPC - Peripheral instance base addresses */
/** Peripheral SPC0 base address */
#define SPC0_BASE                                (0xA9196000u)
/** Peripheral SPC0 base pointer */
#define SPC0                                     ((SPC_Type *)SPC0_BASE)
/** Array initializer of SPC peripheral base addresses */
#define SPC_BASE_ADDRS                           { SPC0_BASE }
/** Array initializer of SPC peripheral base pointers */
#define SPC_BASE_PTRS                            { SPC0 }

/* SYSPM - Peripheral instance base addresses */
/** Peripheral SYSPM base address */
#define SYSPM_BASE                               (0xA9197000u)
/** Peripheral SYSPM base pointer */
#define SYSPM                                    ((SYSPM_Type *)SYSPM_BASE)
/** Array initializer of SYSPM peripheral base addresses */
#define SYSPM_BASE_ADDRS                         { SYSPM_BASE }
/** Array initializer of SYSPM peripheral base pointers */
#define SYSPM_BASE_PTRS                          { SYSPM }

/* TPM - Peripheral instance base addresses */
/** Peripheral TPM0 base address */
#define TPM0_BASE                                (0xA91B1000u)
/** Peripheral TPM0 base pointer */
#define TPM0                                     ((TPM_Type *)TPM0_BASE)
/** Peripheral TPM1 base address */
#define TPM1_BASE                                (0xA91B2000u)
/** Peripheral TPM1 base pointer */
#define TPM1                                     ((TPM_Type *)TPM1_BASE)
/** Peripheral TPM2 base address */
#define TPM2_BASE                                (0xA9144000u)
/** Peripheral TPM2 base pointer */
#define TPM2                                     ((TPM_Type *)TPM2_BASE)
/** Array initializer of TPM peripheral base addresses */
#define TPM_BASE_ADDRS                           { TPM0_BASE, TPM1_BASE, TPM2_BASE }
/** Array initializer of TPM peripheral base pointers */
#define TPM_BASE_PTRS                            { TPM0, TPM1, TPM2 }
/** Interrupt vectors for the TPM peripheral type */
#define TPM_IRQS                                 { NotAvail_IRQn, NotAvail_IRQn, TPM2_INT_IRQn }

/* TRDC - Peripheral instance base addresses */
/** Peripheral TRDC base address */
#define TRDC_BASE                                (0xA91A6000u)
/** Peripheral TRDC base pointer */
#define TRDC                                     ((TRDC_Type *)TRDC_BASE)
/** Array initializer of TRDC peripheral base addresses */
#define TRDC_BASE_ADDRS                          { TRDC_BASE }
/** Array initializer of TRDC peripheral base pointers */
#define TRDC_BASE_PTRS                           { TRDC }
#define MBC0_MEMORY_CFG_WORD_COUNT {8, 1, 1, 2}
#define MBC1_MEMORY_CFG_WORD_COUNT {1, 2, 2, 1}
#define MBC2_MEMORY_CFG_WORD_COUNT {11, 1, 2, 0}
#define MBC3_MEMORY_CFG_WORD_COUNT {0, 0, 0, 0}
#define MBC_MEMORY_CFG_WORD_COUNT {MBC0_MEMORY_CFG_WORD_COUNT , MBC1_MEMORY_CFG_WORD_COUNT, MBC2_MEMORY_CFG_WORD_COUNT, MBC3_MEMORY_CFG_WORD_COUNT}
#define MBC0_MEMORY_NSE_WORD_COUNT {2, 1, 1, 1}
#define MBC1_MEMORY_NSE_WORD_COUNT {1, 1, 1, 1}
#define MBC2_MEMORY_NSE_WORD_COUNT {3, 1, 1, 0}
#define MBC3_MEMORY_NSE_WORD_COUNT {0, 0, 0, 0}
#define MBC_MEMORY_NSE_WORD_COUNT {MBC0_MEMORY_NSE_WORD_COUNT , MBC1_MEMORY_NSE_WORD_COUNT, MBC2_MEMORY_NSE_WORD_COUNT, MBC3_MEMORY_NSE_WORD_COUNT}


/* TRGMUX - Peripheral instance base addresses */
/** Peripheral TRGMUX0 base address */
#define TRGMUX0_BASE                             (0xA9198000u)
/** Peripheral TRGMUX0 base pointer */
#define TRGMUX0                                  ((TRGMUX_Type *)TRGMUX0_BASE)
/** Array initializer of TRGMUX peripheral base addresses */
#define TRGMUX_BASE_ADDRS                        { TRGMUX0_BASE }
/** Array initializer of TRGMUX peripheral base pointers */
#define TRGMUX_BASE_PTRS                         { TRGMUX0 }

/* TX_PACKET_RAM - Peripheral instance base addresses */
/** Peripheral TX_PACKET_RAM base address */
#define TX_PACKET_RAM_BASE                       (0xA9108000u)
/** Peripheral TX_PACKET_RAM base pointer */
#define TX_PACKET_RAM                            ((TX_PACKET_RAM_Type *)TX_PACKET_RAM_BASE)
/** Array initializer of TX_PACKET_RAM peripheral base addresses */
#define TX_PACKET_RAM_BASE_ADDRS                 { TX_PACKET_RAM_BASE }
/** Array initializer of TX_PACKET_RAM peripheral base pointers */
#define TX_PACKET_RAM_BASE_PTRS                  { TX_PACKET_RAM }

/* UART - Peripheral instance base addresses */
/** Peripheral UART base address */
#define UART_BASE                                (0xA8003100u)
/** Peripheral UART base pointer */
#define UART                                     ((UART_Type *)UART_BASE)
/** Array initializer of UART peripheral base addresses */
#define UART_BASE_ADDRS                          { UART_BASE }
/** Array initializer of UART peripheral base pointers */
#define UART_BASE_PTRS                           { UART }

/* UART_PFU - Peripheral instance base addresses */
/** Peripheral UART_PFU base address */
#define UART_PFU_BASE                            (0xA8004000u)
/** Peripheral UART_PFU base pointer */
#define UART_PFU                                 ((UART_PFU_Type *)UART_PFU_BASE)
/** Array initializer of UART_PFU peripheral base addresses */
#define UART_PFU_BASE_ADDRS                      { UART_PFU_BASE }
/** Array initializer of UART_PFU peripheral base pointers */
#define UART_PFU_BASE_PTRS                       { UART_PFU }

